In [62]:
from sqlalchemy import create_engine

In [63]:
import pandas as pd

In [64]:
engine=create_engine("sqlite:///sqlite_db_pythonsqlite.db")

In [65]:
table_names=engine.table_names()

In [66]:
print(table_names)

['Bookings', 'Facilities', 'Members']

In [67]:
con=engine.connect()

In [68]:
rs=con.execute("SELECT f.name,(f.guestcost * COUNT(CASE WHEN b.memid=0 THEN 1 END) +f.membercost * COUNT(CASE WHEN b.memid!=0 THEN 1 END))AS revenue FROM Facilities as f LEFT JOIN Bookings as b ON b.facid = f.facid GROUP BY f.facid ORDER BY revenue DESC")

In [69]:
df=pd.DataFrame(rs.fetchall())

In [70]:
df.columns=rs.keys()

In [72]:
df.head(15)

              name  revenue
0   Massage Room 1  20807.9
1   Massage Room 2   6987.3
2     Squash Court   4970.0
3   Tennis Court 2   4205.0
4   Tennis Court 1   4040.0
5  Badminton Court    604.5
6       Pool Table    265.0
7    Snooker Table    115.0
8     Table Tennis     90.0

In [73]:
rt=con.execute("SELECT m.surname||', '||m.firstname as name, m2.firstname||' '||m2.surname AS recommender FROM Members as m LEFT JOIN Members as m2 ON m.recommendedby = m2.memid ORDER BY name")

In [74]:
data=pd.DataFrame(rt.fetchall())

In [76]:
data.columns=rt.keys()

In [77]:
data.head(20)

                  name        recommender
0      Bader, Florence    Ponder Stibbons
1          Baker, Anne    Ponder Stibbons
2       Baker, Timothy     Jemima Farrell
3          Boothe, Tim         Tim Rownam
4      Butters, Gerald       Darren Smith
5         Coplin, Joan      Timothy Baker
6       Crumpet, Erica        Tracy Smith
7          Dare, Nancy    Janice Joplette
8       Farrell, David               None
9      Farrell, Jemima               None
10        GUEST, GUEST               None
11    Genting, Matthew     Gerald Butters
12          Hunt, John  Millicent Purview
13        Jones, David    Janice Joplette
14      Jones, Douglas        David Jones
15    Joplette, Janice       Darren Smith
16     Mackenzie, Anna       Darren Smith
17       Owen, Charles       Darren Smith
18       Pinker, David     Jemima Farrell
19  Purview, Millicent        Tracy Smith